# Используем официальный образ Python
FROM python:3.10-slim

# Устанавливаем рабочую директорию внутри контейнера
WORKDIR /app

# Копируем requirements.txt и устанавливаем зависимости
COPY requirements.txt .
RUN pip install --no-cache-dir -r requirements.txt

# Копируем остальные файлы проекта в контейнер
COPY . .

# Экспортируем переменные окружения (если используется .env)
# Если хотите, можно закомментировать эту строку и передать переменные при запуске контейнера
# ENV $(cat .env | xargs)

# Указываем команду для запуска бота
CMD ["python", "main.py"]